<a href="https://colab.research.google.com/github/nishJay/Scripting-Lab-Codes/blob/main/Titanic_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Python for Data Science Part B Q3

Load the Titanic dataset into one of the data structures (NumPy or
Pandas) and perform the following operations.


a. Display header rows and description of the loaded dataset.


b. Remove unnecessary features (E.g. drop unwanted columns) from the dataset.


c. Manipulate data by replacing empty column values with a default value.


d. Perform the following visualizations on the loaded dataset:

• Passenger status (Survived/Died) against Passenger Class

• Survival rate of male vs female

• No of passengers in each age group

In [2]:
! pip install kaggle

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: kaggle in /usr/local/lib/python3.7/dist-packages (1.5.12)
Requirement already satisfied: python-slugify in /usr/local/lib/python3.7/dist-packages (from kaggle) (6.1.2)
Requirement already satisfied: python-dateutil in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.8.2)
Requirement already satisfied: requests in /usr/local/lib/python3.7/dist-packages (from kaggle) (2.23.0)
Requirement already satisfied: tqdm in /usr/local/lib/python3.7/dist-packages (from kaggle) (4.64.1)
Requirement already satisfied: urllib3 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.24.3)
Requirement already satisfied: certifi in /usr/local/lib/python3.7/dist-packages (from kaggle) (2022.9.24)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.7/dist-packages (from kaggle) (1.15.0)
Requirement already satisfied: text-unidecode>=1.3 in /usr/local/lib/python3.7/dist-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests->kaggle) (3.0.4)

In [3]:
! mkdir ~/.kaggle

In [4]:
! cp kaggle.json ~/.kaggle/

cp: cannot stat 'kaggle.json': No such file or directory

In [7]:
! pwd

/content

In [9]:

! ls -a

.  ..  .config	sample_data

In [19]:
! cd ..

In [22]:
! cd ..

In [26]:
! mkdir .kaggle

In [27]:
! ls -a

.  ..  .config	.kaggle  sample_data

In [29]:
! mv kaggle.json .kaggle/kaggle.json

In [32]:
! mv .kaggle/kaggle.json ~/.kaggle/kaggle.json

In [34]:
! kaggle competitions download -c titanic

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
Downloading titanic.zip to /content
  0% 0.00/34.1k [00:00<?, ?B/s]
100% 34.1k/34.1k [00:00<00:00, 1.71MB/s]

In [35]:
! unzip titanic.zip

Archive:  titanic.zip
  inflating: gender_submission.csv
  inflating: test.csv
  inflating: train.csv

In [36]:
! ls

gender_submission.csv  sample_data  test.csv  titanic.zip  train.csv

Importing pandas, numpy

In [41]:
import pandas as pd
import numpy as np

Documentations 

[Pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html)

Reading the file from 'train.csv' into variable 'tt' with pandas

In [69]:
tt = pd.read_csv('train.csv')

List out all the columns, along with no. of not null entries and data type.

In [70]:
tt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Changing the entries into strings for better readability in 'Survived' column

In [71]:
tt['Survived']= tt['Survived'].map({
    0:"Died", 1:"Survived"
})

In [72]:
print(tt.head(10))

   PassengerId  Survived  Pclass  \
0            1      Died       3
1            2  Survived       1
2            3  Survived       3
3            4  Survived       1
4            5      Died       3
5            6      Died       3
6            7      Died       1
7            8      Died       3
8            9  Survived       3
9           10  Survived       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

Dropping unwanted columns.
[pd.drop documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html?highlight=drop#pandas.DataFrame.drop)

In [73]:
tt.drop(['Parch','PassengerId','Name','Ticket'], axis=1, inplace=True)

In [60]:
tt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    object
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Cabin     204 non-null    object
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 55.8+ KB

In [61]:
tt.drop(['SibSp','Fare'], axis=1)

     Survived  Pclass     Sex   Age Cabin Embarked
0     margaba       3    male  22.0   NaN        S
1    bachgaya       1  female  38.0   C85        C
2    bachgaya       3  female  26.0   NaN        S
3    bachgaya       1  female  35.0  C123        S
4     margaba       3    male  35.0   NaN        S
..        ...     ...     ...   ...   ...      ...
886   margaba       2    male  27.0   NaN        S
887  bachgaya       1  female  19.0   B42        S
888   margaba       3  female   NaN   NaN        S
889  bachgaya       1    male  26.0  C148        C
890   margaba       3    male  32.0   NaN        Q

[891 rows x 6 columns]

Convert the Class column values to strings for easier reading

[map documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html?highlight=map#pandas.Series.map)

In [75]:

tt['Pclass'] = tt['Pclass'].map({
    1: 'Luxury Class',
    2: 'Economy Class',
    3: 'Lower Class'
})

In [76]:
tt.head(5)

   Survived        Pclass     Sex   Age  SibSp     Fare Cabin Embarked
0      Died   Lower Class    male  22.0      1   7.2500   NaN        S
1  Survived  Luxury Class  female  38.0      1  71.2833   C85        C
2  Survived   Lower Class  female  26.0      0   7.9250   NaN        S
3  Survived  Luxury Class  female  35.0      1  53.1000  C123        S
4      Died   Lower Class    male  35.0      0   8.0500   NaN        S